In [1]:
import pandas as pd

In [4]:
#default index
data=[1,2,3,4,5]
s1=pd.Series(data)
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
#custom index
index=['a','b','d','c','e']
s2=pd.Series(data, index=index)
print(s2)

a    1
b    2
d    3
c    4
e    5
dtype: int64

In [11]:
#dataframe
s1=pd.Series([24,34,25,32,22], name="age")
s2=pd.Series(["Nai","Kisumu","Nakuru","Eldoret","Kampala"], name="city")
s3=pd.concat([s1,s2],axis=1)
print(s3)

   age     city
0   24      Nai
1   34   Kisumu
2   25   Nakuru
3   32  Eldoret
4   22  Kampala

In [12]:
data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'age': [25, 30, 35, 40],
    'city': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data, index=['A', 'B', 'C', 'D'])
df

      name  age           city
A    Alice   25       New York
B      Bob   30  San Francisco
C  Charlie   35    Los Angeles
D    David   40        Chicago

In [17]:
df.loc['A':'C']

      name  age           city
A    Alice   25       New York
B      Bob   30  San Francisco
C  Charlie   35    Los Angeles

In [18]:
print(df.loc[['A','C']])

      name  age         city
A    Alice   25     New York
C  Charlie   35  Los Angeles

In [27]:
print(df.loc[['B','D'],['age','name']])

   age   name
B   30    Bob
D   40  David

In [21]:
print(df.loc['B','age'])

30

In [28]:
data={
    'name':("jaja","jeje","jiji","juju"),
    'age':(22,34,23,14),
    'city':("saja","seje","siji","suju")
}

data

{'name': ('jaja', 'jeje', 'jiji', 'juju'),
 'age': (22, 34, 23, 14),
 'city': ('saja', 'seje', 'siji', 'suju')}

In [29]:
df=pd.DataFrame(data, index=["A","B","C","D"])
print(df)

   name  age  city
A  jaja   22  saja
B  jeje   34  seje
C  jiji   23  siji
D  juju   14  suju

In [30]:
df.iloc[0]

name    jaja
age       22
city    saja
Name: A, dtype: object

In [32]:
df.iloc[[-2, -1]]

   name  age  city
C  jiji   23  siji
D  juju   14  suju